ПД_sev/src/Catalogs/ТелеграмРолиДоступа/ТелеграмРолиДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТелеграмРолиДоступа</name>
</mdclass:Catalog>

ПД_sev/src/InformationRegisters/ТелеграмСвязьРолейДоступа/ТелеграмСвязьРолейДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТелеграмСвязьРолейДоступа</name>
  <dimensions>
    <name>РольДоступа</name>
    <type>
      <types>CatalogRef.ТелеграмРолиДоступа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ПД_sev/src/Catalogs/ТелеграмРолиДоступа/ManagerModule.bsl
Функция ПолучитьМассивРолейПользователя(СсылкаСотрудник) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТелеграмСвязьРолейДоступа.РольДоступа.Наименование КАК РольДоступаНаименование
	               |ИЗ
	               |	РегистрСведений.ТелеграмСвязьРолейДоступа КАК ТелеграмСвязьРолейДоступа
	               |ГДЕ
	               |	ТелеграмСвязьРолейДоступа.Пользователь = &Пользователь
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТелеграмСвязьРолейДоступа.РольДоступа.Наименование";
	Запрос.УстановитьПараметр("Пользователь", СсылкаСотрудник);
	ТЗДанные = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗДанные.ВыгрузитьКолонку("РольДоступаНаименование");
КонецФункции
